{
    "preguntes": [
        {
            "id": 7,
            "text": "(EXAMEN 2022) En una imagen integral construida a partir de cualquier imagen, el píxel más abajo y a la derecha:",
            "respostes": {
                "a": "Es la suma de todos los píxeles de la imagen integral",
                "b": "Es la suma de todos los píxeles de la imagen original",
                "c": "Es el resultado de aplicar una convolución sobre la imagen original con una máscara de tamaño de la imagen original",
                "d": "Ninguno de los anteriores"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 8,
            "text": "(EXAMEN 2022) Los clasificadores débiles en el clasificador Adaboost se necesitan para construir el clasificador Adaboost donde añadimos el siguiente clasificador débil para",
            "respostes": {
                "a": "mejorar el último clasificador débil añadido",
                "b": "mejorar clasificador Adaboost construido hasta la iteración actual",
                "c": "para convolucionar con alguna de las características Haar",
                "d": "ninguno de los anteriores"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 9,
            "text": "(EXAMEN 2022) El clasificador cascada para detectar caras en imágenes combina:",
            "respostes": {
                "a": "Características Haar",
                "b": "Clasificadores débiles",
                "c": "Clasificadores Adaboost",
                "d": "Ninguno de los anteriores"
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 10,
            "text": "(EXAMEN 2022) El clasificador cascada para detectar caras en imágenes:",
            "respostes": {
                "a": "Sirve sólo para detectar caras ya que las características Haar están diseñadas para 'imitar' características faciales",
                "b": "Es aplicable para detectar cualquier tipo de objetos siempre y cuando se utilizan imágenes etiquetadas de estos objetos para entrenar los adalboosts",
                "c": "Es aplicable para detectar los eigenfaces y así reconocer las caras",
                "d": "Ninguno de los anteriores"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 11,
            "text": "(EXAMEN 2022) En los eigenfaces, usamos el trick de los eigenfaces para",
            "respostes": {
                "a": "Simplificar el proceso de obtener los vectores propios a partir de imágenes de tamaño más pequeño",
                "b": "Poder aprender a reconocer las caras con menos ejemplos de caras de aprendizaje",
                "c": "Para compactar el conjunto de imágenes de caras en un espacio de dimensionalidad menor",
                "d": "Ninguno de los anteriores"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 12,
            "text": "(EXAMEN 2022) En los eigenfaces, el trick de los eigenfaces tiene sentido cuando:",
            "respostes": {
                "a": "El número de datos de aprendizaje es menor que el número de píxeles de las imágenes",
                "b": "El número de datos de aprendizaje es mayor que el número de píxeles de las imágenes",
                "c": "Cuando queremos reducir el número de vectores propios",
                "d": "Ninguno de los anteriores"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 13,
            "text": "(EXAMEN 2022) En las redes neuronales convolucionales, la función de pérdida (loss) se utiliza:",
            "respostes": {
                "a": "Dentro del descenso del gradiente para actualizar los pesos de la red",
                "b": "Para calcular cuántas neuronas ha de tener cada capa",
                "c": "Para calcular cuántas capas ha de tener la red neuronal",
                "d": "Ninguno de los anteriores"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 14,
            "text": "(EXAMEN 2022)El proceso de entrenamiento de una red (sin capas congeladas) sirve para modificar:",
            "respostes": {
                "a": "Los pesos de las capas completamente conectadas",
                "b": "Los pesos de las máscaras convolucionales",
                "c": "Los parámetros de la función de pérdida",
                "d": "Los pesos de las capas completamente conectadas y Los pesos de las máscaras convolucionales."
            },
            "correcta": "d",
            "type": "multi"
        },
        {
            "id": 15,
            "text": "En la detección de caras utilizando el método de Viola & Jones, ¿qué papel juegan las 'imágenes integrales'?",
            "respostes": {
                "a": "Identificar características únicas de cada cara",
                "b": "Calcular rápidamente características de Haar",
                "c": "Clasificar imágenes en caras y no caras",
                "d": "Reducir el tamaño de las imágenes para procesamiento"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 16,
            "text": "¿Qué tipo de aprendizaje se utiliza en la Red Neuronal Convolucional (CNN)?",
            "respostes": {
                "a": "Aprendizaje supervisado",
                "b": "Aprendizaje no supervisado",
                "c": "Aprendizaje por refuerzo",
                "d": "Aprendizaje semi-supervisado"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 17,
            "text": "En el contexto de las Redes Neuronales Convolucionales, ¿qué función cumple la técnica de 'Max Pooling'?",
            "respostes": {
                "a": "Normalizar los pesos de la red",
                "b": "Aumentar el tamaño de la imagen de entrada",
                "c": "Reducir la dimensionalidad espacial de la representación",
                "d": "Intensificar las características de color en la imagen"
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 18,
            "text": "¿Qué representa el espacio definido por los 'eigenfaces'?",
            "respostes": {
                "a": "Un subespacio de imágenes no relacionadas con caras",
                "b": "Un subespacio del espacio de imágenes que puede incluir cualquier tipo de objeto",
                "c": "Un subespacio del espacio de imágenes que representa variaciones de caras",
                "d": "Un espacio que solo contiene la imagen media deuna cara"
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 19,
            "text": "En la detección de caras, ¿qué método se utiliza para calcular rápidamente las características Haar?",
            "respostes": {
                "a": "Transformada de Fourier",
                "b": "Imágenes integrales",
                "c": "Redes Neuronales Convolucionales",
                "d": "Algoritmo de Viola-Jones"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 20,
            "text": "¿Que técnica se utiliza para encontrar el subespacio reducido de los 'eigenfaces'?",
            "respostes": {
                "a": "Análisis de componentes principales (PCA)",
                "b": "Análisis de componentes independientes (ICA)",
                "c": "Análisis de componentes principales (PCA) y Análisis de componentes independientes (ICA)",
                "d": "Ninguna de las anteriores"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 21,
            "text": "¿Qué característica principal diferencia el aprendizaje supervisado del no supervisado en el contexto de las Redes Neuronales?",
            "respostes": {
                "a": "El tipo de funciones de activación utilizadas",
                "b": "El uso de etiquetas en los datos de entrenamiento",
                "c": "La velocidad de convergencia del modelo",
                "d": "La arquitectura de la red neuronal"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 22,
            "text": "En el contexto de las Redes Neuronales Convolucionales, ¿qué papel desempeña la función de activación ReLU?",
            "respostes": {
                "a": "Normalizar los datos de entrada",
                "b": "Introducir no linealidad en el modelo",
                "c": "Reducir el sobreajuste en la red",
                "d": "Aumentar la velocidad de convergencia"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 23,
            "text": "Cuanto medirá la imagen resultante de aplicar una máscara de convolución de 3x3 a una imagen de 5x5?",
            "respostes": {
                "a": "3x3",
                "b": "5x5",
                "c": "7x7",
                "d": "9x9"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 24,
            "text": "Cuanto medirá (normalmente) la última capa de una red neuronal convolucional para clasificar fotos 420x420 de tipos perro, gato, conejo?(PENDIENTE DE REVISAR)",
            "respostes": {
                "a": "3x1",
                "b": "3x3",
                "c": "3x(420x420)",
                "d": "Ninguna de las anteriores"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 25,
            "text": "Cuál de las siguientes afirmaciones es cierta?",
            "respostes": {
                "a": "El método de Viola & Jones es un método de detección de caras basado en características Haar",
                "b": "El método de Viola & Jones es un método de detección de caras basado en características SIFT",
                "c": "El método de Viola & Jones es un método de detección de caras basado en características AdaBoost",
                "d": "Ninguna de las anteriores"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 26,
            "text": "Cuál de las siguientes afirmaciones es cierta?",
            "respostes": {
                "a": "La función de pérdida (loss) se utiliza para calcular el score de una imagen",
                "b": "La función de pérdida (loss) se utiliza para calcular el error de una imagen",
                "c": "La función de pérdida (loss) se utiliza para calcular el error de una red neuronal",
                "d": "Ninguna de las anteriores"
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 27,
            "text": "Cuál de las siguientes afirmaciones es VERDADERA ?",
            "respostes": {
                "a": "La función de entropía cruzada (cross-entropy) se utiliza para calcular el error de una red neuronal",
                "b": "La función de entropía cruzada (cross-entropy) se utiliza para dividir la imagen en regiones",
                "c": "La función de entropía cruzada (cross-entropy) se utiliza para calcular el score de una imagen",
                "d": "Ninguna de las anteriores"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 28,
            "text": "¿De que otra forma se les conoce a los eigenfaces?",
            "respostes": {
                "a": "Vectores propios",
                "b": "Lambda",
                "c": "Valores Propios",
                "d": "Ninguna de las anteriores"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 29,
            "text": "¿En la formula argmin_f(sum(error(y_i(f),y_i))) ¿Que es f?",
            "respostes": {
                "a": "La función de pérdida",
                "b": "La función de activación",
                "c": "La función de clasificación",
                "d": "Ninguna de las anteriores"
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 30,
            "text": "¿En la formula argmin_f(sum(error(y_i(f),y_i))) ¿Que es y_i?",
            "respostes": {
                "a": "El valor de la imagen",
                "b": "El valor de la etiqueta",
                "c": "El valor de la función de pérdida",
                "d": "Ninguna de las anteriores"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 31,
            "text": "¿En la formula argmin_f(sum(error(y_i(f),y_i))) ¿Que es y_i(f)?",
            "respostes": {
                "a": "El valor de la predicción",
                "b": "El valor de la etiqueta",
                "c": "El valor de la función de pérdida",
                "d": "Ninguna de las anteriores"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 32,
            "text": "¿Si estamos en un clasificador con la formula f(x)=w*x+b, que es w?",
            "respostes": {
                "a": "El nodo actual",
                "b": "La imagen de entrada",
                "c": "Las clases de salida",
                "d": "La matriz de pesos"
            },
            "correcta": "d",
            "type": "multi"
        },
        {
            "id": 33,
            "text": "¿Si estamos en un clasificador con la formula f(x)=w*x+b, que es b?",
            "respostes": {
                "a": "El nodo actual",
                "b": "La imagen de entrada",
                "c": "El residuo",
                "d": "El bias"
            },
            "correcta": "d",
            "type": "multi"
        },
        {
            "id": 34,
            "text": "¿Si estamos en un clasificador con la formula f(x)=w*x+b, que es x?",
            "respostes": {
                "a": "El nodo actual",
                "b": "La imagen de entrada",
                "c": "El residuo",
                "d": "El bias"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 35,
            "text": "En una CNN, ¿cómo se suele estructurar la secuencia de capas para el procesamiento efectivo de imágenes?",
            "respostes": {
                "a": "Capa convolucional - ReLU - max-pooling y finalmente una capa completamente conectada.",
                "b": "Capa completamente conectada, seguida de max-pooling, luego ReLU y finalmente una capa convolucional.",
                "c": "Capa convolucional - luego max-pooling - RELU y finalmente una capa completamente conectada.",
                "d": "Capa max-pooling, seguida de ReLU, luego una capa convolucional y finalmente una capa completamente conectada."
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 36,
            "text": "¿Qué no permite el Cascade Classifier de Viola-Jones al añadir más clasificadores?",
            "respostes": {
                "a": "Añadir falsos negativos",
                "b": "Añadir falsos positivos",
                "c": "Añadir más características Haar",
                "d": "Añadir más clasificadores débiles"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 37,
            "text": "Cual es el objetivo de la clasifiación de caracteristicas de imagenes?",
            "respostes": {
                "a": "Definir patrones de apariencia de objetos en la imagen",
                "b": "Definir un espacio de características de imagen que permite representar objetos en función de su apariencia (o a través de un conjunto de características locales) en la imagen.",
                "c": "Aplicar algoritmos de aprendizaje no supervisado para descubrir patrones ocultos en la imagen",
                "d": "Definir técnicas de transferencia de aprendizaje para mejorar el rendimiento del modelo"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 38,
            "text": "Un píxel en una imagen integral...",
            "respostes": {
                "a": "Es la suma de todos los píxeles de la imagen tras aplicar una convolución sobre la imagen original con una máscara de tamaño nxn",
                "b": "Es la suma de todos los píxeles de la imagen original que están por encima y a la izquierda de él",
                "c": "Es el resultado de la segunda derivada de la imagen original",
                "d": "Ninguno de los anteriores"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 39,
            "text": "Cuantos puntos son necesarios para calcular con la imagen integral la suma de los píxeles de una región rectangular de la imagen?",
            "respostes": {
                "a": "1",
                "b": "2",
                "c": "6",
                "d": "4"
            },
            "correcta": "d",
            "type": "multi"
        },
        {
            "id": 40,
            "text": "¿Que representan los eigenvalues?",
            "respostes": {
                "a": "Los vectores propios de la matriz de covarianza",
                "b": "Los vectores propios de la matriz de covarianza normalizada",
                "c": "Miden la variancia de la data en la direccion del eigenvector",
                "d": "Miden la variancia de la data en la direccion del eigenvector normalizado"
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 41,
            "text": "Para una imagen en escala de grises (n x n) y un filtro/Kernel (f x f), el dimensiones de la imagen resultante de una operación de convolución es",
            "respostes": {
                "a": "(n-f+1) x (n-f+1)",
                "b": "(n+f-1) x (n+f-1)",
                "c": "nxf",
                "d": "fxf"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 42,
            "text": "¿Como trabajmos con diferentes escalas de la imagen en el método de Viola-Jones?",
            "respostes": {
                "a": "Reescalando la imagen y no reescalando las características",
                "b": "Reescalando la imagen y reescalando las características",
                "c": "No reescalando la imagen y reescalando las características",
                "d": "No reescalando la imagen y no reescalando las características"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 43,
            "text": "¿A que da más prioridad los nuevos clasificadores débiles en adabost?",
            "respostes": {
                "a": "A los ejemplos que se clasificaron mal en el clasificador anterior",
                "b": "A los ejemplos que se clasificaron bien en el clasificador anterior",
                "c": "A los ejemplos que se clasificaron mal en el clasificador anterior y a los ejemplos que se clasificaron bien en el clasificador anterior",
                "d": "A los ejemplos que se clasificaron mal en el clasificador anterior y a los ejemplos que se clasificaron bien en el clasificador anterior"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 44,
            "text": "¿Cuál de las siguientes técnicas puede ayudar a prevenir el sobreajuste en una red neuronal?",
            "respostes": {
                "a": "Aumentar el número de parámetros para capturar patrones más complejos.",
                "b": "Implementar una parada anticipada para detener el entrenamiento cuando el rendimiento en un conjunto de validación comienza a degradarse.",
                "c": "Eliminar el uso compartido de parámetros para garantizar que cada punto de datos se trate de forma independiente.",
                "d": "Evitar la caída del peso, ya que penalizar la magnitud de los parámetros puede provocar un desajuste."
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 45,
            "text": "La técnica de eigenfaces es invariante a",
            "respostes": {
                "a": "La rotación de la cara",
                "b": "La escala (lo cerca de la cara)",
                "c": "La iluminación de la cara",
                "d": "Todas las anteriores"
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 46,
            "text": "¿Cuál de las siguientes no es una limitación de la técnica de eigenfaces para el reconocimiento facial?",
            "respostes": {
                "a": "Requiere que las caras estén alineadas",
                "b": "Sensible a las variaciones de iluminación",
                "c": "Incapaz de manejar bien las expresiones faciales",
                "d": "Incapaz de realizar clasificaciones en tiempo real"
            },
            "correcta": "d",
            "type": "multi"
        },
        {
            "id": 51,
            "text": "En la detección de caras utilizando la cascada de clasificadores de Viola-Jones, ¿cuál es la idea principal detrás de la cascada?",
            "respostes": {
                "a": "Aumentar la velocidad de detección evitando la clasificación detallada en todas las etapas",
                "b": "Mejorar la precisión combinando múltiples clasificadores fuertes",
                "c": "Reducir la dimensión de las imágenes antes de la clasificación",
                "d": "Aplicar una transformación no lineal a las características de la imagen"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 57,
            "text": "¿Cuál es la principal ventaja de utilizar las redes neuronales convolucionales (CNN) para el análisis de imágenes sobre los enfoques tradicionales?",
            "respostes": {
                "a": "Requieren menos preprocesamiento de datos",
                "b": "Son más rápidas en la clasificación",
                "c": "Tienen una mejor interpretación de los resultados",
                "d": "Aprenden automáticamente las características importantes de las imágenes"
            },
            "correcta": "d",
            "type": "multi"
        },
        {
            "id": 58,
            "text": "¿Qué característica es esencial para que las CNNs manejen eficazmente las variaciones en la posición de los objetos dentro de las imágenes?",
            "respostes": {
                "a": "Conexiones densas",
                "b": "Invariancia de traslación",
                "c": "Normalización de lotes",
                "d": "Dropout regularizado"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 59,
            "text": "En el contexto de la detección de caras con eigenfaces, ¿qué representa un eigenvalue (valor propio) en el análisis de componentes principales (PCA)?",
            "respostes": {
                "a": "La varianza de los datos en la dirección del eigenvector correspondiente",
                "b": "El promedio de los valores de pixel en una cara",
                "c": "La distancia entre las caras en el espacio de características",
                "d": "La cantidad de ruido presente en las imágenes de caras"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 60,
            "text": "¿Qué estrategia se emplea comúnmente en las CNNs para reducir el número de parámetros y controlar el sobreajuste?",
            "respostes": {
                "a": "Aumento de la tasa de aprendizaje",
                "b": "Uso de un número mayor de capas convolucionales",
                "c": "Aplicación de la técnica de max-pooling",
                "d": "Incremento en el tamaño del batch de entrenamiento"
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 61,
            "text": "En la técnica de eigenfaces para el reconocimiento facial, ¿cuál es la función principal del análisis de componentes principales (PCA)?",
            "respostes": {
                "a": "Clasificar directamente las caras",
                "b": "Aumentar el contraste entre las caras en las imágenes",
                "c": "Reducir la dimensionalidad del espacio de caras",
                "d": "Generar nuevas caras para aumentar el conjunto de datos"
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 62,
            "text": "¿Qué método se utiliza en las CNNs para actualizar los pesos de la red de manera efectiva durante el entrenamiento?",
            "respostes": {
                "a": "Backpropagation",
                "b": "Forward propagation",
                "c": "Descentrado de gradientes",
                "d": "Regularización L1"
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 63,
            "text": "En la detección de caras, ¿qué ventaja ofrece el uso de una cascada de clasificadores como en el método de Viola-Jones?",
            "respostes": {
                "a": "Reduce la necesidad de datos de entrenamiento",
                "b": "Disminuye la posibilidad de falsos negativos a cada etapa",
                "c": "Aumenta la robustez frente a variaciones de iluminación",
                "d": "Mejora la eficiencia computacional al descartar rápidamente regiones no faciales"
            },
            "correcta": "d",
            "type": "multi"
        },
        {
            "id": 66,
            "text": "¿En qué consiste la técnica de 'data augmentation' en el contexto del entrenamiento de modelos de visión artificial?",
            "respostes": {
                "a": "Aumentar la cantidad de datos eliminando características irrelevantes",
                "b": "Generar artificialmente más datos a partir del conjunto de datos existente",
                "c": "Aumentar el número de parámetros en el modelo para ajustarse mejor a los datos",
                "d": "Incrementar la profundidad de la red para mejorar la capacidad de extracción de características"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 67,
            "text": "¿Qué método de la técnica de eigenfaces es responsable de proyectar las imágenes de caras en un espacio de menor dimensión?",
            "respostes": {
                "a": "Análisis de conglomerados",
                "b": "Análisis de componentes principales (PCA)",
                "c": "Transformada de Fourier",
                "d": "Máquinas de vectores de soporte (SVM)"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 69,
            "text": "En la técnica de eigenfaces, ¿qué se utiliza para medir cuánta varianza de los datos de las caras es capturada por cada componente principal?",
            "respostes": {
                "a": "La distancia euclidiana",
                "b": "El valor medio de las caras",
                "c": "Los eigenvalues asociados a los eigenvectors",
                "d": "El error de clasificación del modelo"
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 70,
            "text": "¿Cuál es la principal ventaja de utilizar AdaBoost en la detección de caras?",
            "respostes": {
                "a": "Disminuir el tiempo de entrenamiento del clasificador",
                "b": "Aumentar la capacidad de la red para manejar datos de alta dimensión",
                "c": "Combinar múltiples clasificadores débiles para formar uno robusto",
                "d": "Reducir la necesidad de preprocesamiento de imágenes"
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 71,
            "text": "En el método de Viola-Jones para la detección de caras, ¿qué papel juega el clasificador en cascada?",
            "respostes": {
                "a": "Identificar características específicas de la cara como ojos o boca",
                "b": "Reducir rápidamente el número de regiones a evaluar para la presencia de una cara",
                "c": "Mejorar la resolución de las imágenes de entrada",
                "d": "Aumentar la cantidad de características de Haar utilizadas en el proceso de detección"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 72,
            "text": "¿Cómo clasificamos una nueva imagen en el método de eigenfaces?",
            "respostes": {
                "a": "Calculando la distancia euclidiana entre la nueva imagen y las imágenes de entrenamiento",
                "b": "Proyectando la nueva imagen en el espacio de eigenfaces y luego utilizando un clasificador como k-NN para determinar la etiqueta más cercana",
                "c": "Comparando directamente los histogramas de color de la nueva imagen con los de las imágenes de entrenamiento",
                "d": "Usando una red neuronal para determinar las características más importantes de la nueva imagen"
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 73,
            "text": "(EXAMEN 2017)El método de Viola-Jones de detección de caras es un método de aprendizaje automático porque:",
            "respostes": {
                "a": "Utiliza kmeans para detectar el clúster que corresponde a una cara vs no cara.",
                "b": "Utiliza un conjunto de imágenes de aprendizaje para entrenar un clasificador, en particular el Adaboost.",
                "c": "Utiliza el método de knn para detectar si una imagen o una región de una imagen representa una cara.",
                "d": "Utiliza características Haar que después las proyecta y agrupa en el espacio de los eigenfaces para decidir si una imagen o una región es una cara o no."
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 74,
            "text": "(EXAMEN 2017)Una característica Haar está determinada por:",
            "respostes": {
                "a": "Un conjunto de 2 o 3 rectángulos con signos opuestos (1 y -1) que se aplica en una posición concreta de la imagen.",
                "b": "Un conjunto de 2 o 3 rectángulos con signos opuestos que se aplican sobre toda la imagen.",
                "c": "Un conjunto de 1 o 2 rectángulos con signos opuestos (1 y -1) que se aplica sobre la imagen en una posición concreta.",
                "d": "Una máscara que puede tener cualquier valor y que se aplica sobre la imagen en una posición concreta para entrenar un clasificador."
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 75,
            "text": "(EXAMEN 2017)Dada una imagen de caras, podemos obtener la imagen integral:",
            "respostes": {
                "a": "Aplicando el integral sobre la imagen original.",
                "b": "Aplicando un banco de filtros de las derivadas de la Gaussiana.",
                "c": "A partir de la imagen original sumando los valores de todos los píxeles a la izquierda y hacia arriba.",
                "d": "Convolucionando la imagen original con un conjunto de características Haar."
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 76,
            "text": "(EXAMEN 2017)Una cascada de clasificadores:",
            "respostes": {
                "a": "Es sinónimo de un clasificador Adaboost.",
                "b": "Es un conjunto de clasificadores débiles.",
                "c": "Es un conjunto de clasificadores Adaboost, donde cada Adaboost es un conjunto de clasificadores débiles.",
                "d": "Es un conjunto de clasificadores Adaboost donde cada Adaboost intenta corregir el error del anterior recuperando las imágenes de caras que haya perdido el anterior."
            },
            "correcta": "c",
            "type": "multi"
        },
        {
            "id": 77,
            "text": "(EXAMEN 2017)El método de reconocimiento de caras basado en eigenfaces:",
            "respostes": {
                "a": "Tiene como objetivo aplicar el método del análisis de los componentes principales para encontrar los eigenfaces donde cada eigenface es un prototipo que representa una persona. Dada una nueva imagen de una cara la clasificación consiste en encontrar a qué eigenface se parece esta cara.",
                "b": "Pretende encontrar un nuevo espacio que tiene como bases los eigenfaces donde se hace la clasificación. La ventaja de este nuevo espacio es que es de menor dimensionalidad que el espacio original de las caras y que representa mejor las caras.",
                "c": "Pretende construir una cascada de eigenfaces para reconocer personas.",
                "d": "Se puede aplicar sólo si las imágenes están en color."
            },
            "correcta": "b",
            "type": "multi"
        },
        {
            "id": 78,
            "text": "(EXAMEN 2017)El problema de reconocimiento de caras es:",
            "respostes": {
                "a": "Una forma de crear un sistema biométrico.",
                "b": "La única forma de tener un sistema biométrico.",
                "c": "No tiene nada que ver con los sistemas biométricos.",
                "d": "La última fase en cualquier sistema biométrico."
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 79,
            "text": "(EXAMEN 2017)En el espacio de los eigenfaces, cada punto:",
            "respostes": {
                "a": "Corresponde a una cara.",
                "b": "Corresponde a un píxel de una cara.",
                "c": "Corresponde a una fila de una imagen de una cara.",
                "d": "Corresponde a un eigenface."
            },
            "correcta": "a",
            "type": "multi"
        },
        {
            "id": 80,
            "text": "(EXAMEN 2017)En el espacio de los eigenfaces, para clasificar una imagen de cara del conjunto de aprendizaje con el knn:",
            "respostes": {
                "a": "Antes hemos de aplicar un clustering con kmeans para agrupar todos los ejemplos de caras de la misma persona.",
                "b": "El método nos dará error ya que por definición el conjunto de aprendizaje y test han de ser diferentes.",
                "c": "El método knn (lo más probable) nos retornará la misma imagen.",
                "d": "El método knn nos retornará la eigenface más parecida."
            },
            "correcta": "c",
            "type": "multi"
        },

        {
        "id": 81,
        "text": "(EXAMEN 2023)El método de Eigenfaces utiliza como espacio de características:",
        "respostes": {
            "a": "Las derivadas de las Gaussianas",
            "b": "El espacio de los eigenfaces",
            "c": "El espacio definido por los histogramas de los tres canales de las imágenes en color",
            "d": "Ninguna de las anteriores"
        },
        "correcta": "b",
        "type": "multi"
        },
        {
        "id": 82,
        "text": "(EXAMEN 2023)Los valores propios de la matriz de covarianza de las caras de aprendizaje em el método de los eigenfaces sirve para:",
        "respostes": {
            "a": "Descartar eigenfaces redundantes e innecesarias",
            "b": "Encontrar imagenes defectuosas en el conjunto de las imagenes de aprendizaje",
            "c": "Determinar si una imagen contiene una cara o no",
            "d": "Ninguna de las anteriores"
        },
        "correcta": "a",
        "type": "multi"
        },
        {
        "id": 83,
        "text": "(EXAMEN 2023)Dado el método de los eigenfaces, k eigenfaces u1,u2,...,uk , la cara promedia es /X y una imagen de cara X, aplicando la fórumla: (w1,w2,3,...,wk) = (X - /X)T * (u1,u2,...,uk)",
        "respostes": {
            "a": "Obtenemos las coordenadas (w1,w2,w3,...,wk) de la imagen X en el espacio de los eigenfaces",
            "b": "(w1,w2,w3,...,wk) corresponden a los valores propios de los eigenfaces.",
            "c": "(w1,w2,w3,...,wk) son las k caras más parecidas a la cara X",
            "d": "Ninguna de las anteriores"      
        },
        "correcta": "a",
        "type": "multi"
        },
        {
        "id": 84,
        "text": "(EXAMEN 2023)Dada la representación de una imagen en el espacio de los eigenfaces X = /X + sum(w_i * u_i) donde u_i son los eigenfaces, si consideramosla iamgen X2=X/2 y consideramos su representación en el espacio de los eigenfaces X2 = /X2 + sum(w_2_i * u_2_i), entonces:",
        "respostes": {
            "a": "/X2 = (/x)/2 Y w2_i = w_i/2",
            "b": "/X2 = (/x)/2 y u2_i = u_i/2",
            "c": "/X2 = (/x) y u2_i = u_i",
            "d": "Ninguna de las anteriores"
        },
        "correcta": "c",
        "type": "multi"
        },
        {
            "id": 85,
            "text": "(EXAMEN 2023)En una imagen integral construida a partir de una imagen uint8, si el píxel de la esquina abajo derecha es 0, significa que:",
            "respostes": {
                "a": "la imagen es negra",
                "b": "la imagen tiene tantos píxeles positivos como negativos",
                "c": "la última fila contiene solo 0s",
                "d": "ninguno de los anteriores"
            },
            "correcta": "a",
            "type": "multi"
        },
        
        {
            "id": 86,
            "text": "(EXAMEN 2023)Una cascada es una secuencia de clasificadores donde:",
            "respostes": {
                "a": "Cada clasificador contiene un Adaboost que contiene un clasificador débil",
                "b": "Cada clasificador contiene un Adaboost que intenta corregir los falsos positivos del clasificador anterior",
                "c": "Cada clasificador contiene un Adaboost que intenta corregir los falsos negativos del clasificador anterior",
                "d": "Ninguno de los anteriores"
            },
            "correcta": "b",
            "type": "multi"
        },
        
        {
            "id": 87,
            "text": "(EXAMEN 2023)Aplicar una característica Haar tiene complejidad:",
            "respostes": {
                "a": "O(n*m) donde (n,m) representa el tamaño de la imagen",
                "b": "O(1)",
                "c": "O(n*m) donde (n,m) representa el tamaño de la característica Haar",
                "d": "Ninguno de los anteriores"
            },
            "correcta": "b",
            "type": "multi"
        },
        
        {
            "id": 88,
            "text": "(EXAMEN 2023)Entrenamos una red neuronal:",
            "respostes": {
                "a": "minimizando la función de puntuación (score function)",
                "b": "minimizando la función de pérdida (loss function)",
                "c": "minimizando el número de parámetros que tiene la red",
                "d": "Ninguno de los anteriores"
            },
            "correcta": "b",
            "type": "multi"
        },
        
        {
            "id": 89,
            "text": "(EXAMEN 2023)Una red neuronal tiene un gran número de pesos (parámetros) por entrenar que vienen principalmente de:",
            "respostes": {
                "a": "Las capas convolucionales",
                "b": "Las capas de activación",
                "c": "Las capas de pooling y la función de pérdida",
                "d": "Las capas completamente conectadas (fully connected)"
            },
            "correcta": "d",
            "type": "multi"
        }
    ]
}